const ar = {
  translation: {
    الرئيسية: "الرئيسية",
    التحديات: "التحديات",
    المتصدرين: "المتصدرين",
    التقدم: "التقدم",
    البروفايل: "البروفايل",
    "هيا بنا نصنع الخير معًا!": "هيا بنا نصنع الخير معًا!",
    "تقدم حسناتك": "تقدم حسناتك",
    "مرحباً": "مرحباً",
    "سنابل الإحسان": "سنابل الإحسان",
    "سنبلة الصيام": "سنبلة الصيام",
    "سنبلة الصدقة": "سنبلة الصدقة",
    "سنبلة الصلاة": "سنبلة الصلاة",
    "عرض الكل": "عرض الكل",

    "متابعة": "متابعة",
    "تخطي": "تخطي",
    "سنابل الإحسان هو تطبيق تفاعلي يعزز القيم النبيلة للأطفال":
      "سنابل الإحسان هو تطبيق تفاعلي يعزز القيم النبيلة للأطفال",
    "تغيير اللغة": "تغيير اللغة",

    // Onboarding translations
    "مرحباً بك في": "مرحباً بك في",
    "👋سنابل الإحسان": "👋سنابل الإحسان",
    "ازرع سنبلة تُثمر": "ازرع سنبلة تُثمر",
    "خيراً وأجراً": "خيراً وأجراً",
    "تسابقوا إلى": "تسابقوا إلى",
    "الخيرات، فإنها لا تدوم": "الخيرات، فإنها لا تدوم",
    "إغتنم الفرص لفعل الخير، فالحسنات تتضاعف مع كل عمل صالح":
      "إغتنم الفرص لفعل الخير، فالحسنات تتضاعف مع كل عمل صالح",
    "لا تفوّت الفرصة لفعل الخير، فالأجر يعمّ والحسنات تُكتب":
      "لا تفوّت الفرصة لفعل الخير، فالأجر يعمّ والحسنات تُكتب",
   
 
      // ChangePassword component translations
      "8 أحرف كحد أدنى": "8 أحرف كحد أدنى",
      "رقم": "رقم",
      "رمز": "رمز",
      "إعادة تعيين كلمة السر": "إعادة تعيين كلمة السر",
      "تأمين حسابك بكلمة مرور جديدة": "تأمين حسابك بكلمة مرور جديدة",
      "ادخل كلمة السر": "ادخل كلمة السر",
      "كلمة السر": "كلمة السر",
      "حفظ": "حفظ",
      "ليس لديك حساب؟": "ليس لديك حساب؟",
      "إنشاء حساب": "إنشاء حساب",
      "تم تغير كلمة السر بنجاح": "تم تغير كلمة السر بنجاح",
      "قم بتسجيل الدخول و ابدأ في جمع الحسنات": "قم بتسجيل الدخول و ابدأ في جمع الحسنات",
      "تسجيل الدخول": "تسجيل الدخول",


      // ForgotPassword component translations
      "التحقق من البريد الإلكتروني": "التحقق من البريد الإلكتروني",
      "هل نسيت كلمة السر؟": "هل نسيت كلمة السر؟",
      "أدخل بريدك الالكتروني لإعادة تعيين كلمة السر": "أدخل بريدك الالكتروني لإعادة تعيين كلمة السر",
      "لقد أرسلنا للتو الرمز المكون من 4 أرقام إلى": "لقد أرسلنا للتو الرمز المكون من 4 أرقام إلى",
      "أدخله أدناه:": "أدخله أدناه:",
      "الرمز": "الرمز",
      "البريد الإلكتروني": "البريد الإلكتروني",
      "تأكيد الرمز": "تأكيد الرمز",
      "ارسل الرمز": "ارسل الرمز",
      "لم تتلق رمز": "لم تتلق رمز",
      "بعد؟": "بعد؟",
      "إعادة الإرسال": "إعادة الإرسال",
      "email_example": "مثال: mohamedmonge7@gmail.com",
    
        // Login component translations

     
        "سجل الآن واستمتع بتجربة تفاعلية تبني العطاء والانتماء":"سجل الآن واستمتع بتجربة تفاعلية تبني العطاء والانتماء",

  
        "حفظ الحساب": "حفظ الحساب",
        
         // Signup process
    "انشاء حساب جديد": "انشاء حساب جديد",
    "انشاء حساب واستمتع بتجربة تفاعلية تبني العطاء والانتماء": "انشاء حساب واستمتع بتجربة تفاعلية تبني العطاء والانتماء",
    "ادخل اسمك واسم والدك": "ادخل اسمك واسم والدك",
    "اكمل حسابك واستمتع بتجربة تفاعلية تبني العطاء والانتماء": "اكمل حسابك واستمتع بتجربة تفاعلية تبني العطاء والانتماء",
    "اسمك": "اسمك",
    "اسمك الأول": "اسمك الأول",
    "اسم والدك": "اسم والدك",
    "اختار جنسك (بنت - ولد)": "اختار جنسك (بنت - ولد)",
    "ولد": "ولد",
    "بنت": "بنت",
    "ادخل تاريخ عيد ميلادك 🎂": "ادخل تاريخ عيد ميلادك 🎂",
    "اليوم": "اليوم",
    "الشهر": "الشهر",
    "السنة": "السنة",
    "اختار مرحلتك الدراسية 🎓": "اختار مرحلتك الدراسية 🎓",
    "الابتدائي": "الابتدائي",
    "الاعدادي": "الاعدادي",
    "الثانوي": "الثانوي",
    "ادخل رمز لولي امرك": "ادخل رمز لولي امرك",
    "رمز الوالدين": "رمز الوالدين",
    "اصنع رمز لوالديك حتي يمكنهم تحرير تقدمك": "اصنع رمز لوالديك حتي يمكنهم تحرير تقدمك",
    "اضع صورة شخصية لك": "اضع صورة شخصية لك",
    "أبدا رحلة جمع الحسنات": "أبدا رحلة جمع الحسنات",
  
   
  },
};

export default ar;
